const iymon = document.querySelector('.iymon')
const namoz = document.querySelector('.namoz')
const roza = document.querySelector('.roza')
const haj = document.querySelector('.haj')
const zakot = document.querySelector('.zakot')

const a = document.querySelector('a')




const quyosh = document.querySelector('#quyosh')
const quyosh1 = document.querySelector('#quyosh1')
const quyosh2 = document.querySelector('#quyosh2')
const quyosh3 = document.querySelector('#quyosh3')
const quyosh4 = document.querySelector('#quyosh4')

const iyman = document.querySelector('#iyman')  

iymon.addEventListener('click', () => {


    quyosh.textContent = ''
    quyosh1.textContent = ''
    quyosh2.textContent = ''
    quyosh3.textContent = ''
    quyosh4.textContent = ''

    document.querySelector('#namoz_vaqtlari').textContent = ''

     

    const btn1 = document.createElement('div')
    const btn2 = document.createElement('div')
    const btn3 = document.createElement('div')

    btn1.textContent = 'Iymon nima?'
    btn2.textContent = 'Din va shariat haqida?'
    btn3.textContent = 'Alloh taologa iymon'

    btn1.classList.add('index')
    btn2.classList.add('index')
    btn3.classList.add('index')

    const btn12 = document.createElement('div')    
    const btn22 = document.createElement('div') 
    const btn32 = document.createElement('div') 

    btn12.classList.add('child')
    btn22.classList.add('child')
    btn32.classList.add('child')

    btn1.addEventListener('click',() => {
        btn12.textContent = `«Иймон»нинг маъноси тасдиқ этиш, ишонишдир. Пайғамбаримиз Муҳаммад алайҳиссаломга Аллоҳ таоло томонидан етказилган барча нарсаларни дил билан тасдиқлаб, уларга тил билан иқрор бўлиш «иймон» дейилади.

    Иймон бундай изҳор қилинади:
    
    أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرُسُولُهُ.
    
     
    
    «Ашҳаду аллаа илааҳа иллаллоҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳ» (яъни «Гувоҳлик бераманки, Аллоҳ таолодан ўзга илоҳ йўқдир ва гувоҳлик бераманки, Муҳаммад алайҳиссалом Унинг бандаси ва Расулидир).
    
    Ким бу калимани тили билан айтиб, дили билан унинг маъносини тасдиқ ва қабул қилса, яъни Аллоҳ таоло ягона сиғиниладиган Зотдир, Ундан ўзга сиғинишга лойиқ ҳеч мавжудот йўқ, Муҳаммад алайҳиссалом Аллоҳ таолонинг бандаси ва расулидир, Муҳаммад алайҳиссалом Аллоҳ таоло томонидан етказган барча нарса ҳақ-ростдир, деб қалби билан тасдиқ ва қабул қилса ҳамда тили билан шунга иқрор бўлсагина иймонли саналади. Ибодат ва солиҳ амалларнинг қабул бўлиши учун иймон шартдир.`
    btn32.innerHTML = ''
})

    btn2.addEventListener('click',()=> {
        btn22.textContent = `Алҳамдулиллаҳ, барчаларимиз мусулмонлармиз, суюкли Пайғамбаримиз Муҳаммад алайҳиссалом келтирган Ислом динининг ҳақ эканлигига эътиқод қиламиз, унинг аҳкомларини адо этамиз. Гоҳида шундай савол ҳам туғилиб қолади: «Дин нима ўзи?»

    «Дин» сўзи «итоат, парҳез, эътиқод, ҳисоб, ишонч, мукофот, ҳукм, йўл тутиш» деган маъноларни билдиради. Дин илоҳий йўл-йўриқлар, Аллоҳ таоло буюрган ҳукмлар, ибодатлар ва ақидалар мажмуидир. Дин ақлли инсонларни хайрли ва эзгу ишларга етаклайди, фақат яхшиликка бошлайди. Ейиш, ичиш, ухлаш моддий эҳтиёж бўлганидек, дин ҳам маънавий эҳтиёждир. 
    
    Барча пайғамбарлар алайҳимуссалом даъват этган динларнинг асоси биттадир: пайғамбарлар инсонларни оламни ягона Аллоҳ таоло яратганига иқрор бўлишга ва фақат Унга ибодат қилишга даъват этишган. Улар етказган ҳукмлардагина фарқ бор, асосий даъватларида эса фарқ йўқ. Дунёда дини, ишончи бўлмаган бирор миллат ёки халқ йўқ. Чунки ҳеч бир миллат, халқ динсиз яшай олмайди. Динсизлик, Аллоҳга, Унинг ваҳийларига, охиратга ишонмаслик (яъни куфр келтириш) инсониятнинг энг катта кулфатидир. «Куфр» сўзи луғатда «инкор этиш», «рад қилиш», «беркитиш» маъноларини билдиради. Шаръий ҳукмларни инкор этувчи одам «кофир», унинг қилмишлари «кофирлик» дейилади. Аллоҳнинг борлигини ва бирлигини, Муҳаммад алайҳиссалом етказган хабарларни инкор, рад этганлар кофир саналади. Яна инсон ўзининг асл табиати тасдиқлайдиган ҳақ йўлни тан олмаса, ички туйғу ҳақиқатини беркитса, ҳақни беркитган бўлади. 
    
    «Ислом» – «бўйсуниш, тоат, ихлос, тинчлик, сулҳ» демакдир. Ислом тавҳид (яккахудолик) динидир. Аллоҳ таоло юборган барча пайғамбарлар инсониятни асоси бир динга – Аллоҳ таолонинг борлиги ва бирлигига, Унинг китобларига, фаришталарига, пайғамбарларига ва Қиёмат кунига иймон келтиришга, фақат Унга ибодат қилишга даъват этишган. Ислом динидаги кишилар «мусулмон-муслим» деб аталади. Ҳозир ер юзида салкам бир ярим миллиард нафар мусулмон бор. 
    
    Мусулмонлар Ислом шариатига мувофиқ ҳаёт кечирадилар. «Шариат» сўзи луғатда «изҳор қилмоқ, баён этмоқ, йўл» маъносида бўлиб, «тўғри йўл, илоҳий йўл, қонунчилик»ни англатади. Шаръий истилоҳда Ислом динининг ҳукмлар тўплами, Аллоҳ таолонинг амр ва тақиқлари «шариат» дейилади. Пайғамбарлар даъват этган динларнинг асоси бир бўлса-да, улар етказган ҳукмлар, яъни шариатлар турличадир. Шунинг учун кейин келган пайғамбар даврида аввалда ўтган пайғамбар етказган ҳукмлар (шариат) бекор бўлган. Пайғамбаримиз етказган ҳукмлар, яъни Ислом шариати қиёматгача боқийдир. Инсонлар манфаатини таъминлаш ва уни ҳимоя қилиш шариатнинг асосий мақсадидир. Бу ердаги манфаатдан инсон хоҳиш-истагига мос манфаат тушунилмайди, балки инсоннинг шаръий мезондаги ҳақиқий манфаати тушунилади. Кундалик ҳаёт тарзининг Ислом шариатига мувофиқ бўлишини таъминловчи қонунлар ва мезонлар «фиқҳ» дейилади. «Шаръий аҳком» – Аллоҳнинг буюрган, қайтарган ёки ихтиёр этган қатъий кўрсатмаларидир. Аллоҳ таоло Шориъ, яъни шариат асосчисидир. `
    btn12.textContent = ''})

   btn3.addEventListener('click', () => {
    btn32.textContent = `Инсон учун энг биринчи вазифа ва бурч Аллоҳ таолога иймон келтиришдир. Аллоҳга иймон келтириш бўлмас экан, иймон келтириш лозим бўлган бошқа нарсаларга ҳам иймон бўлмайди. Киши ҳамма нарсани ёлғиз Аллоҳ таоло яратганини, Ундан ўзгага сиғиниб бўлмаслигини, У комил сифатлар билан сифатланганини, айб-нуқсондан поклигини қалби билан тасдиқлаб, тили билан иқрор бўлсагина Аллоҳ таолога иймон келтирган бўлади. 

    Аллоҳ таоло зоти ва сифатларида ягонадир, қадимдир (мавжудлигининг аввали йўқ), доимдир (мавжудлигининг ниҳояси йўқ), тирикдир, билувчидир, қодирдир, ихтиёрлидир (истаганини қилади), сўзлагувчидир, эшитувчидир, кўрувчидир. Аллоҳ таоло жисм ҳам, жавҳар (яъни модда) ҳам, араз (ранг, ҳид каби) ҳам эмас. Унинг сурати ва шакли йўқ. Аллоҳ таоло бирор томонда ва маконда эмас. Зеро, У Зот макон ва томонни Ўзи яратган. Аллоҳ таолонинг борлиги замон билан белгиланмайди. Аллоҳ таоло исмлари, зотий ва феълий сифатлари билан ҳамиша бўлган ва бўлади. Аллоҳ таолонинг бирорта исми ва сифати янги пайдо бўлмаган. 
    
    Аллоҳ таолонинг зоти ва сифатларида ўхшаши, акси, тенги йўқ. Аллоҳ таоло ҳеч бир нарсага муҳтож эмас. Аллоҳ таоло охиратда мўминларга Ўз зотига муносиб, кайфиятсиз равишда кўринади. Ҳамма нарса Аллоҳ таолонинг хоҳиши, ҳукми ва тақдири билан бўлади. Аллоҳ таоло барча нарсани билади, ҳамма нарсага қодирдир. 
    
    Аллоҳ таолонинг сифатлари азалий ва абадийдир. Аллоҳ таолонинг сифатлари саккизта: 
    
    Ҳаёт – тириклик. Аллоҳ таоло тирикдир. 
    
    Илм – билиш. Аллоҳ таоло ҳамма нарсани билувчидир. 
    
    Қудрат – қодирлик. Аллоҳ таоло ҳамма нарсага қодирдир. 
    
    Самъа – эшитиш. Аллоҳ таоло ошкор ва пинҳонни эшитувчидир, ҳеч нарса Унга махфий эмасдир. 
    
    Басар – кўриш. Аллоҳ таоло ҳамма нарсани кўради, ҳеч нарса Ундан яширин эмасдир. 
    
    Ирода – хоҳиш. Аллоҳ таоло хоҳлаган нарса бўлади, хоҳламаган нарса бўлмайди. 
    
    Калом – сўзлаш. Аллоҳ таоло сўзлагувчидир. 
    
    Таквин – йўқдан яратиш. Аллоҳ таоло оламни йўқдан яратган, ҳамма нарсанинг яратувчиси Аллоҳ таолодир. 
    
    Бу сифатлардан ҳаёт, илм, қудрат, самъа, басар, ирода ва калом сифатлари Аллоҳ таолонинг зотий сифатларидир. Таквин сифати ҳам Аллоҳ таолонинг зотий сифати бўлиб, барча феълий сифатлар Аллоҳ таолонинг «таквин» сифати остига киради. Аллоҳ таолонинг ҳеч бир сифати махлуқларнинг сифатига асло ўхшамайди. `
    btn22.innerHTML = ''
   })
    btn1.appendChild(btn12)
    btn2.appendChild(btn22)
    btn3.appendChild(btn32)

    
        
    iyman.appendChild(btn1)
    iyman.appendChild(btn2)
    iyman.appendChild(btn3)
    
})

const namaz = document.querySelector('#namaz')

namoz.addEventListener('click', () => {
    
  

    document.querySelector('#iyman').textContent = ''    

    const btn1 = document.createElement('div')
    const btn2 = document.createElement('div')
    const btn3 = document.createElement('div')

    btn1.textContent = 'Namozga poklanish.'
    btn2.textContent = `G'usl`
    btn3.textContent = 'Tahorat'

    btn1.classList.add('index')
    btn2.classList.add('index')
    btn3.classList.add('index')

    const btn12 = document.createElement('div')    
    const btn22 = document.createElement('div') 
    const btn32 = document.createElement('div') 

    btn12.classList.add('child')
    btn22.classList.add('child')
    btn32.classList.add('child')

    btn1.addEventListener('click',() => {
        btn12.textContent = `Бизнинг ҳаниф Ислом динимиз покликка жуда катта аҳамият берган ва мусулмонларни намоз ўқишдан аввал таҳорат (бунинг иложи бўлмаганда таяммум) қилишга буюрган. Улар таҳорат қилишаётганда юзлари, қўллари ва оёқларини ювишади. Шунингдек, Ислом мўминларни ғусл қилиш, бундан ташқари мўйлов ва тирноқларини қисқартириш, кийимларини покиза тутиш, жамоат жойларида, хусусан, жума ва ҳайит намозларида хушбўйланиб юришга тарғиб қилади. 

        Дарҳақиқат, Расулуллоҳ соллаллоҳу алайҳи васаллам сафардан қайтаётган саҳобаларига: «Сизлар биродарларингиз ҳузурига қайтмоқдасиз. Шундай экан, уловларингизу либосларингизни чиройли ҳолда тутинглар. Ҳатто одамлар ичида гўёки хол каби ажраб туринглар. Албатта, Аллоҳ бузуқлик ва ахлоқсизликни яхши кўрмайди», деб айтганлар (Имом Абу Довуд ривоят қилган).`
    btn32.innerHTML = ''
})

    btn2.addEventListener('click',()=> {
        btn22.textContent = `Ғуслнинг «бир нарсанинг устидан сув оқизиш» маъноси бор. Шариатда эса Аллоҳ таолога яқинлик ниятида баданнинг ҳамма ерига сув оқизиб тозалаш «ғусл» дейилади. Инсон шаръан тайин қилинган ҳолларда вужудидаги нопокликларни кетказиш учун ғусл қилиб тозаланиши шарт. Ғусл қилиши лозим бўлган одамнинг ғусл қилмасдан намоз ўқиши, Қуръон ушлаши ёки тиловат қилиши, масжидга кириши ва бошқа ибодатларни адо этиши мумкин эмас. Ҳаж ва умра учун эҳромга кириш, жума ва ҳайит намозлари олдидан ғусл қилиш суннат амаллардан саналади. 
        ҒУСЛНИНГ ФАРЗЛАРИ ВА СУННАТЛАРИ
Ғуслнинг фарзлари

а) оғизни (халқумгача ғарғара қилиб) чайиш;

б) бурунга сув тортиб чайиш;

в) бутун аъзоларга сув етказиб ишқалаб ювиш.

Ғуслнинг суннатлари

а) ғуслни «Бисмиллаҳ...» билан бошлаш;

б) ғуслга ният қилиш;

نَوَيْتُ أَنْ أَغْتَسِلَ غُسْلًا مِنَ الْجَنَابَةِ، رَافِعًا لِلْحَدَثِ، وَاسْتِبَاحَةً لِلصَّلَاةِ، وَطَهَارَةً لِلْبَدَنِ، وَتَقَرُّبًا مِنَ اللهِ تَعَالَى، اللهُ أَكْبَرُ.

«Навайту ан ағтасила ғуслан минал-жанаабати, рофиъан лил-ҳадаси, ва истибааҳатан лис-солаати, ва тоҳааротан лил-бадани, ва тақоррубан миналлоҳи таъаалаа. Аллоҳу акбар!»

Маъноси: Нопокликни кетказиш, намоз дуруст бўлиши учун баданни поклаш ва Аллоҳга яқин бўлиш учун жанобатдан ғусл қилишга ният қилдим.

в) икки қўлини бўғими билан қўшиб ювиш;

г) олатни (жинсий аъзони) ювиш;

д) бадандаги нажасни ювиб кетказиш;

е) таҳорат олиш (сув тўпланадиган жойда турган бўлса, оёқлар кейин ювилади, аксинча бўлса, оёқлар ҳам ювилади);

ж) баданнинг ҳамма ерига етказиб уч бора сув қуйиш;

з) сув қуйишни бошдан бошлаш, аввал ўнг, сўнгра чап елкага сув қуйиш;

и) оёқларни сув тўпланган жойдан ташқарида алоҳида ювиш;

 к) сочи ўрилган аёл бошининг ўзини (соч тагини) ювиши кифоя, лекин сочи ёзиқ бўлса, унинг ҳаммасини ювади. `
    btn12.textContent = ''})

   btn3.addEventListener('click', () => {
    btn32.textContent = ` `
    btn22.innerHTML = `ТАҲОРАТНИНГ ШАРТЛАРИ
    1. Ювилиши фарз бўлган ҳар бир аъзони қолдирмай ювиш. 
    
    2. Аъзоларга сув етишидан тўсадиган нарсалар бўлмаслиги. Сувдан тўсадиган нарсалар: хамир, мум, аёллар тирноқларига қўядиган лак ва шу кабилар. 
    
    3. Таҳоратга киришишдан олдин таҳоратга тўсқинлик қилувчи ҳар қандай нопокликлардан ҳоли бўлиш. 
    
    Пешоб томаётган вақтда, бурун қонаётганда уларни тўхтатмасдан қилинган таҳорат дуруст бўлмайди, чунки улар (бавл ва қон) таҳоратга тўсқинлик қилувчи нопокликлардандир. Лекин бурни доим тўхтамай қонайдиган, пешоби ҳам тўхтамай томиб турадиган кишининг таҳорати ва намози узр сабабидан дуруст бўлади. Фақат шу шарт биланки, узрли одам ҳар бир намознинг вақти учун алоҳида таҳорат қилади. 
    
    ШАРИАТ ИСТИЛОҲИДА ТАҲОРАТ ИККИ ҚИСМГА БЎЛИНАДИ
    1. Баданнинг ўзини ҳадасдан (яъни бетаҳоратликдан) поклаш – бу махсус аъзоларни ювиб таҳорат қилиш билан ёки бутун баданни ювиб ғусл қилиш билан) бўлади. Сув топилмай қолган пайтда ёки истеъмолидан ожиз бўлган вақтда ғусл ва таҳоратнинг ўринбосари бўлмиш таяммум билан ҳосил бўлади. 
    
    2. Кийимдаги, бадандаги ва макондаги нажосатдан поклаш. 
    
    Таҳорат фарз, вожиб ёки мандублигига кўра уч қисмга бўлинади: 
    
    1. Фарз – таҳоратсиз киши агар намоз ўқимоқчи бўлса (у хоҳ нафл, хоҳ жаноза намози бўлсин, барибир); ёки тиловат саждаси қилмоқчи бўлсин ё Мусҳафни ушламоқчи бўлсин, унга таҳорат қилиш фарз бўлади. 
    
    2. Вожиб – Каъбаи муаззамани тавоф қилмоқчи бўлган таҳоратсиз кишига таҳорат қилиш вожибдир. 
    
    3. Мандуб, яъни тавсия қилинган таҳорат – таҳоратсиз кишининг уйқудан олдин, уйғонгандан кейин таҳорат олиши; таҳоратли кишининг устига яна таҳорат олиши; ғийбат, чақимчилик, ёмон сўзлардан, ҳар бир хатодан сўнг, маййитни ювгандан кейин, яна ҳар намозга алоҳида таҳорат олиш; жунуб кишининг ғусл қилишдан олдин, овқатланишдан, ичимлик ичишдан, ухлашдан, яна бир бор эр-хотинлик қилишдан олдин таҳорат олиши; ғазаб келганда таҳорат қилиш (чунки ғазаб шайтондан бўлиб, шайтон эса ўтдан яратилгандир, ўт эса сув билан ўчирилади); Қуръон қироат қилиш, ҳадис ўқиш, шаръий илмлардан дарс қилиш, азон ва иқомат айтиш, хутба ўқиш, Пайғамбаримиз соллаллоҳу алайҳи васалламнинг қабрларини зиёрат қилиш, Арафот тоғида туриш, Сафо ва Марвани саъй қилиш учун қилинган таҳорат мандуб ҳисобланади. Яна туя гўштини егандан сўнг таҳорат олиш ҳам мандубдир. 
    
    Уламоларга мухолиф бўлмаслик учун ҳам таҳорат олиш одобдир. Мисол учун, аёл кишини ушлаш билан имом Шофеъий наздларида таҳорат синади, худди шунингдек, кафтининг ичи билан ўз авратини ушласа ҳам. Бизнинг мазҳабимизда бу кўринишда таҳорат синмаса ҳам яна қайта олиш одобдандир. Чунки ҳамма уламоларнинг иттифоқига кўра қилинган ибодат чиройли бўлади. 
    
    ТАҲОРАТНИНГ ФАРЗЛАРИ
    Таҳоратнинг фарзлари тўрттадир:
    
    1. Юзни бир марта ювиш. «Ювиш» дегани сув тегиши лозим бўлган ўринлардан сув оқизишдир. Шунинг учун аъзоларга қорни ишқалаб намлаш билан таҳорат ҳосил бўлмайди, балки уни баданда эритиб, бир-икки томчи оқизгачгина таҳорат дуруст бўлади. Юз-нинг чегараси узунасига соч чиққан жойдан жағнинг остигача, кенглиги эса икки қулоқ юмшоғининг орасигача бўлган ўриндир. Соқол қалин бўлиб, остидаги тери кўринмайдиган даражада бўлса, юз қисмидаги соқолнинг устини ювиш фарздир. Аммо соқол сийрак ва юзни беркитмайдиган бўлса, унда сувни соқолнинг остига етказиш вожиб бўлади.
    
    2. Икки қўлни тирсаклари билан қўшиб бир марта ювиш.
    
    3. Бошнинг тўртдан бирига бир марта масҳ тортиш.
    
    4. Икки оёқни ҳам ошиғи билан қўшиб бир марта ювиш. Оёқнинг ошиғи қадамдан юқорида, тўпиқдан пастдаги бўртиб кўриниб турган суякдир.
    
    Таҳорат қиладиган киши агар тирноқлари узун бўлса, унинг остига сув етказиши ва яна кўзи атрофига йиғилиб қоладиган кирларни олиб, остига сув теккизиши ҳам шартдир. Сув етказишда қўлни ҳўллаб, теккизиб қўйиш кифоя қилмайди, балки ўша жойдан сув оқизиш шартдир.`
   })
    btn1.appendChild(btn12)
    btn2.appendChild(btn22)
    btn3.appendChild(btn32)

    
        
    namaz.appendChild(btn1)
    namaz.appendChild(btn2)
    namaz.appendChild(btn3)
    
})

const rozador = document.querySelector('#roza')   

roza.addEventListener('click', () => {

    namaz.textContent = ''
    

     

    const btn1 = document.createElement('div')
    const btn2 = document.createElement('div')
    const btn3 = document.createElement('div')

    btn1.textContent = `Ro'za qanday ibodat.`
    btn2.textContent = `Ro'zaning darajalari.`
    btn3.textContent = `Ro'zaning shartlari.`

    btn1.classList.add('index')
    btn2.classList.add('index')
    btn3.classList.add('index')

    const btn12 = document.createElement('div')    
    const btn22 = document.createElement('div') 
    const btn32 = document.createElement('div') 

    btn12.classList.add('child')
    btn22.classList.add('child')
    btn32.classList.add('child')

    btn1.addEventListener('click',() => {
        btn12.textContent = `Шаръий истилоҳда эса Рамазон ойида тонг отганидан то қуёш ботгунча ният билан овқат емаслик, ичимлик ичмаслик, жинсий яқинлик қилмаслик «рўза» дейилади. Рўза тутиш Ислом динининг беш рукни, беш асосидан биридир, Қуръон ва Суннат билан собит бўлган.

        Рўза ақли расо, соғлиғи яхши бўлган ҳар бир мусулмон эркакка ҳамда ҳайз ва нифосдан пок бўлган мусулмон аёлга фарз қилинган. Ҳайз ва нифос кўрган аёллар рўза тутишмайди, кейин қолдирган кунларининг қазосини тутиб беришади. Янги ойни кўриб, рўзага ният қилиш Рамазон рўзасининг асосий шартларидандир. Рамазон ойида ношаръий амаллар қилмаслик, тилни ғийбат, ёлғон сўзлардан тийиш, ўзгага озор бермаслик, яхши хулқли ва раҳм-шафқатли бўлиш рўзанинг одобларидандир.
        
        Рамазон кечасида туриб саҳарлик қилишнинг ўзи рўзанинг ниятига ўтади, чунки саҳарлик қилаётган одамнинг кўнглига рўза тутиш нияти ўз-ўзидан келади. Ҳанафий мазҳабида Рамазон тугагунича ҳар куни ният янгилаб турилади.
        
        Ҳанафий мазҳабига кўра, Рамазон рўзасини тутишда ҳар кунги ниятни қуёш оққунигача янгилаб олса ҳам бўлаверади, яъни киши тонгдан чошгоҳгача рўзага зид иш қилмай турса, қуёш тиккага келишидан озгина олдин ўша куннинг рўзаси учун ният қилса ҳам, рўза ҳисобига ўтади. Лекин тонгдан кейин еб-ичиб қўйган бўлса, кейин ният қилса дуруст бўлмайди.
        
        Рўзадор кишига яна ушбулар суннатдир: нафсни ёмон ниятлардан тўхтатиш; фойдасиз ҳамда уятсиз сўзларни гапиришдан ва эшитишдан ўзини сақлаш; биров билан уришишдан, ҳар қандай гуноҳ ишлардан ўзни тортиш; мумкин қадар истиғфор, зикр ва тасбеҳ билан банд бўлиш; Қуръон ўқиш; қуёш ботган вақтда шом намозини ўқишдан олдин бир қултум сув билан бўлса ҳам оғиз очиш; Рамазон ойида ҳар куни хуфтон намозидан сўнг йигирма ракат таровеҳ намози ўқиш; таровеҳ намозида Қуръони Каримни ўқиб ёки эшитиб хатм қилиш; Рамазонда хуфтонни жамоат билан ўқиган кишининг витр намозини ҳам жамоат билан ўқиши.
        
        Нафсни поклаш ва ахлоқни сайқаллашда намоз ва закотдан кейин рўза ибодати келади. Инсонни йўлдан урадиган нарсалар ичида қорин ва жинсий шаҳватлар энг кучлиларидан экани ҳеч кимга сир эмас. Рўзанинг фойдаларидан бири худди ўша икки шаҳватни жиловлашга хизмат қилишидир.`
    btn32.innerHTML = ''
})

    btn2.addEventListener('click',()=> {
        btn22.textContent = `Аҳли ҳақнинг наздида рўзанинг даражаси учтадир:

        Биринчи даража омманинг рўзаси бўлиб, у қорин ва фаржнинг истак-хоҳишларидан тийилишдир.
        
        Иккинчи даража хосларнинг рўзаси бўлиб, у биринчи даражага зиёда ўлароқ кўз, қулоқ, тилни, оёқ, қўл ва бошқа аъзоларни ҳам гуноҳлардан тийишдир.
        
        Учинчи даража хослардан ҳам хосларнинг рўзаси бўлиб, у аввалги икки даражага зиёда ўлароқ қалбни беҳуда қизиқишлардан, дунёвий фикрлардан ва Аллоҳ таолодан бошқа нарсалардан тийишдан иборатдир.
        
        Хосларнинг рўзаси «солиҳлар рўзаси» деб ҳам номланади. Бу даражадаги рўзанинг мукаммал бўлиши қуйидаги омиллар билан рўёбга чиқади:
        
        1. Барча ёқимсиз ва ёмон нарсалардан кўзни тийиш ҳамда қалбни Аллоҳ таолонинг зикридан тўсадиган нарсаларга машғул қилмаслик.
        
        2. Тилни ёлғон, ғийбат, чақимчилик, фаҳш-уят гаплар, жафо, хусумат, мақтанчоқликка ўхшаш нарсалардан тийиб, сукутни лозим тутиш. Уни Аллоҳ таолонинг зикри ва Қуръон тиловати билан машғул қилиш. Бу, тилнинг рўзасидир.
        
        3. Қулоқни эшитиш макруҳ бўлган барча нарсалардан, бошқача қилиб айтганда, юқорида санаб ўтилган нарсаларнинг ҳаммасидан сақлаш. Чунки гапириш мумкин бўлмаган барча нарсани эшитиш ҳам мумкин эмас.
        
        4. Қўл, оёқ ва бошқа аъзоларни гуноҳлардан сақлаш ҳамда ифтордан кейин қоринни шубҳали таомлардан сақлаш. Зотан, қоринни ҳалол нарсадан сақлаб рўза тутиб, кейин ҳалол бўлмаган нарса билан ифтор қилишнинг маъноси ҳам йўқ. Ҳаром нарсалар динни ҳалок қилувчи заҳардир. Ҳалол эса дори каби ози фойдали, кўпи зарарлидир.
        
        5. Ифторда ҳаддан ташқари кўп еб, қоринни тўйдириб юборишдан сақланиш. Бундай қилиш билан рўзадан кўзланган мақсад амалга ошмайди. Чунки рўзадан кўзланган мақсадлардан бири очликнинг машаққатини ҳис қилишдир. Мазкур мақсадга эришиш эса, рўзадан бошқа вақтларда нонуштада тановул қиладиган таомни саҳарликда ва кечки овқатда тановул қиладиганини ифторда истеъмол қилиш билан бўлади.
        
        Ифтордан сўнг қалб хавф ва ражо орасида бўлиши лозим, чунки рўзаси қабул бўлиб, муқарраб бандалар қаторига қўшилдими ёки қабул бўлмай, ғазабга учраганлардан бўлдими, аниқ эмас. Ҳар бир ибодатдан фориғ бўлгандан сўнг шу ҳолатда бўлиш лозим.
        
        Рамазон тақво ойидир. Бу ойда хулқимиз янада юксалиб, ҳаром ва шубҳалардан ҳар қачонгидан ҳам кўпроқ тийилишимиз зарур. Шундай табаррук ойда қиз-келинларимизни миллийлигимизга ёт бўлган ҳолатда кийиниб юришдан, эркакларимизни номаҳрамларга кўз тикишдан қайтаришимиз лозим. Ваҳоланки, ҳадисда «Кўнгилнинг тақвоси ҳаромга қарамасликдир», дейилган.
        
        Рамазон ибодатларни кўпайтириш, гуноҳларга мағфират сўраш, Қуръон билан ошно бўлиш, Аллоҳга бандаликни юксак даражага кўтариш ойидир. Шундай бўлгач, Рамазонни тақво, ҳалоллик, ҳусни хулқ ва яхшиликлар ойига айлантириш ҳар бир мусулмоннинг бурчидир. `
    btn12.textContent = ''})

   btn3.addEventListener('click', () => {
    btn32.textContent = ` `
    btn22.innerHTML = `Рўза дуруст бўлиши учун уч хил шарт топилиши лозим.

    Биринчи шарт – зиммага лозим бўлиш шартлари.
    
    Бу шартлар тўрттадир:
    
    1. Ислом. Мусулмон бўлмаган одамга рўза фарз бўлмайди. Ундай одам рўза тутса ҳам, рўзаси ибодат ўрнига ўтмайди. Кофир одам Рамазонда Исломга кирса, ўша кундан бошлаб рўза тутади.
    
    2. Ақл. Ақли йўқ одамга рўза фарз бўлмайди, чунки у мукаллаф эмас.
    
    3. Балоғат. Балоғатга етмаган ёш болаларга рўза фарз бўлмайди. Рамазон ойида балоғатга етганлар ўша кундан бошлаб рўза тутишни бошлайдилар.
    
    Иккинчи шарт – рўзани адо этиш учун лозим шартлар:
    
    Бу шартлар иккитадир:
    
    1) Соғлом бўлиш. Бемор кишига рўза тутиш вожиб эмас.
    
    2) Муқим бўлиш. Мусофирга рўза тутиш фарз эмас. У сафардан қайтганда қазосини тутиб беради.
    
    Учинчи шарт – рўзанинг тўғри бўлиши шартлари.
    
    Бу шартлар учтадир:
    
    1) Ният. Ниятсиз рўза дуруст бўлмайди.
    
    2) Нифос ва ҳайздан холи бўлиш. Нифос ва ҳайзли бўлатуриб тутилган рўза дуруст бўлмайди.
    
    Рамазон рўзасининг адоси ва қазоси шаръий кундузнинг ярмидан аввал ният қилиш билан тўғри бўлади.
    
    Маълумки, қилиниши лозим бўлган амални шариатда белгиланган вақтда қилиш «адо» дейилади. Қилиниши лозим бўлган амални белгиланган вақтидан кейин бажариш «қазо» дейилади.
    
    Рамазон рўзасини вақтида тутиш фарз. Агар у вақтида адо қилинмаган бўлса, қазосини тутиш фарз.
    
    Шунингдек, каффорат рўзалари ҳам вожибдир. Бировни хато, эҳтиётсизлик сабабли ўлдириб қўйган ёки аёлини зиҳор қилган одам бошқа каффоратларни бажара олмаса, кетма-кет икки ой рўза тутиши вожиб бўлади.
    
    Шаръий кундуз тонг отгандан (субҳи содиқдан) бошланиб, қуёш ботгунча давом этади. Шаръий бўлмаган кундуз эса «луғавий кундуз» деб аталади ва у қуёш чиққандан бошлаб ботгунча давом этади. Демак, рўза тутмоқчи бўлган киши тонг отгандан бошлаб кундузнинг ярмигача ният қилиб олса, рўзаси тўғри бўлади.`
   })
    btn1.appendChild(btn12)
    btn2.appendChild(btn22)
    btn3.appendChild(btn32)

    
        
    rozador.appendChild(btn1)
    rozador.appendChild(btn2)
    rozador.appendChild(btn3)
    
})

const hajIbodati = document.querySelector('#haj') 

haj.addEventListener('click', () => {

    document.querySelector('#roza').textContent = ''
    

       

    const btn1 = document.createElement('div')
    const btn2 = document.createElement('div')
    const btn3 = document.createElement('div')

    btn1.textContent = `Haj qanday ibodat.`
    btn2.textContent = `Hajning odoblari.`
    btn3.textContent = `Ehromga kirish`

    btn1.classList.add('index')
    btn2.classList.add('index')
    btn3.classList.add('index')

    const btn12 = document.createElement('div')    
    const btn22 = document.createElement('div') 
    const btn32 = document.createElement('div') 

    btn12.classList.add('child')
    btn22.classList.add('child')
    btn32.classList.add('child')

    btn1.addEventListener('click',() => {
        btn12.textContent = `Ҳaж ибoдaтининг бoшқa ибoдaтлaрдaн бир фарқи шуки, у ҳaммaгa ҳaм бир пaйтнинг ўзидa фaрз бўлaвeрмaйди, бaлки aйрим шaртлaригa мувoфиқ кeлгaн мусулмoнлaргaгинa фaрздир. Қoдир бўлгaн oдaмлaргa Aллoҳ учун Бaйтни ҳaж қилиш фaрз. Улaмoлaр кишигa ҳaж фaрз бўлиши учун қуйидaги шaртлaр мaвжуд бўлиши кeраклигини тaъкидлaшгaн:

        1) мусулмoн бўлиши;
        
        2) бaлoғaтгa eтгaн бўлиши;
        
        3) oқил бўлиши;
        
        4) ҳажга қoдир бўлиши;
        
        5) сoғ-сaлoмaт бўлиши;
        
        6) ҳукумaт мaн қилмaгaн бўлиши;
        
        7) йўлдa oмoнлик бўлиши;
        
        8) aёл кишига мaҳрaми бўлиши;
        
        Kимдa ушбу шaртлaрдaн бирoртaси бўлмaсa, унга ҳaж фарз бўлмайди.
        
        Ҳаж – Исломнинг беш арконидан бири бўлган улуғ рукн, Аллоҳга маҳбуб ибодатдир. Бу ибодат Аллоҳ таолога юзланиш, У Зотнинг тажаллийси, нурининг маркази бўлган масканда адо этилади. Ҳадиси шарифларда келишича, Байтуллоҳи шариф шундай маконга жойлашганки, унинг айни устида, еттинчи осмонда Байтул Маъмур, унинг устида эса Аллоҳ таолонинг Арши жойлашган. Аллоҳ таолонинг таважжуҳи, нури ва тажаллиёти дастлаб Каъбатуллоҳга нозил бўлиб, кейин бутун оламга тарқалади. Шу сабабли бу ерга келиш бахтига мушарраф бўлган мусулмонлар учун улкан саодат бор.
        
        Ҳаж ошиқона ибодат бўлиб, у ерга бориш фақат ҳазрати Иброҳим алайҳиссаломнинг ҳаж эълонига «лаббай» деб жавоб берган кишиларгагина насиб этади. У неча маротаба лаббай деган бўлса, Каъбатуллоҳни ўшанча марта тавоф қилиш шарафига муяссар бўлади. Шунингдек, у ерга бориб, ҳаж ибодатини адо этиш яна бир саодатга сабабдир.
        
        Ҳaж ибoдaтидa улкaн ҳикмaтлaр бўлиб, бу ҳикмaтлaрнинг бaрчaсини инсoннинг oжиз aқли тўлa aнглaб oлиши қийин. Шундай бўлсa ҳaм улaмoлaр ижтиҳoд қилганлaр.
        
        Ҳаждa ислoмий бирлик ёрқин нaмoён бўлaди. Ҳaж чoғида мусулмoнлaрнинг ҳис-туйғулaри, ибoдaтлaри вa ҳaттo суврaтлaри бир xил бўлaди. Бу eрдa ирқчилик, мaҳaллийчилик, тaбaқaчилик кaби салбий ҳолатлaргa ўрин қолмайди. Ҳaммa бир Aллoҳга иймoн келтириб, бир Бaйтуллoҳни тaвoф қилaди. Tинчлик Ислoмнинг шиoри экaни ҳaждa янa бир бoр нaмoён бўлади. Ҳaммa тинч, юрт тинч, ибoдaт тинч, халқ тинч бўлади.
        
        Ҳаж улкaн ислoмий aнжумaн бўлиб, ҳaр бир мусулмoн дунёнинг турли бурчaклaридaн кeлган дин қaрдoшлaри билaн учрaшaди, турли мaсaлaлaрни муҳoкaмa қилaди. Ислoм вa иймoн риштaлaри мустaҳкaмлaнaди.
        
        Ҳaждa мусулмoн бaндa омонлик юрти бўлмиш Maккaи мукaррамaгa сaфар қилaди. Maккa – улуғ, муқaддaс шaҳaр. Aллoҳ тaoлo Қуръoни Кaримдa унинг нoми билaн қaсaм ичгaн. Ўзининг уйи бўлмиш Kaъбaнинг шу шaҳaрдa қaрoр топишини ирoдa қилгaн.
        
        Ҳaж улуғ руҳий oзуқa бeрaдигaн ибoдaт бўлиб, ундa мусулмoн бaндaнинг вужуди Aллoҳ таологa тaқвo билaн, Унгa тoaт қилишгa aзму қaрор билaн, гунoҳлaригa нaдoмaт билaн тўлaди. Бу сaфaрдa мусулмон кишининг Aллoҳга, Унинг Рaсулигa вa мўмин-мусулмoнлaргa бўлган муҳaббaти зиёдa бўлади. Дунёнинг ҳaмма тaрaфлaридaги дин қaрдoшлaригa нисбaтaн дўстлик туйғулaри уйғoниб, мустaҳкaмлaнaди.`
    btn32.innerHTML = ''
})

    btn2.addEventListener('click',()=> {
        btn22.textContent = `1. Ҳаж қилмоқчи бўлган одам, аввало, Aллoҳ тaoлoгa aстoйдил тaвбa қилсин. Гунoҳлaрини тaрк эта туриб, aввaл сoдир бўлгaнлaригa нaдoмaт қилиб, бундaн сўнг тaкрoрлaмасликкa aзму қaрoр қилсин.

        2. Kимгa зулм eткaзгaн, кимни xaфa қилгaн ёки кимнинг кўнглини қoлдиргaн бўлсa, улaрдaн узр сўрaсин.
        
        3. Энг муҳим жиҳaтлaрдaн бири – қилaётгaн ҳаж ибoдaтидaн Aллoҳ таолонинг рoзилигини вa oxирaтининг oбoдлигини кўзлaсин. Дунё вa унинг зийнaтлaрини, риёкoрлик, нoм чиқaриш, фaxрлaниш кaби нaрсaлaрни зинҳoр вa зинҳoр xaёлигa кeлтирмaсин. Aкс ҳoлдa, бaрчa қилгaн сaъй-ҳaрaкaтлaри бeҳудa, бефойда кетaди.
        
        4. Oтa-oнaлaри тирик бўлишсa, улaрнинг рoзиликлaрини oлсин, дуoлaрини сўрасин.
        
        5. Ҳaж сaфaри билaн oвoрa бўлиб, бoшқa ибoдaтлaргa эътибoрсизлик қилмaсин. Aйниқсa, нaмoзгa эҳтиёт бўлсин, чунки намoз зaрурлиги жиҳатидан ҳаждaн ҳaм эътибoрлидир.
        
        6. сaфaр чoғидa дoимo Аллоҳ таолони зикр этсин, дуoлар қилсин, истиғфорлар aйтсин. Қуръoни Кaримни тилoвaт қилсин. Тилини бўлмағур гaплaрдaн, бeҳудa сўзлaрдaн, ёлғoн, ғийбaт, чaқимчилик, сўкиш кaби бузуқликлaрдaн тийилсин. Қўлидaн кeлгaничa oдaмлaргa яxшилик қилиш пaйидaн бўлсин.
        
        7. Ўтгaн улaмoлaримизнинг энг муҳим нaсиҳaтлaридaн бири шуки, ҳoжилaр ҳaж дaвoмидa қaлбни мaшғул қилувчи, xaёлни oлиб қoчувчи тижoрaтдaн xoли бўлишлaри кeрaк. Ўзлaрини xoр тутсинлaр, зeбу зийнaтгa эътибoр бермaсинлaр.
        
        8. Ҳажга қилинадиган сарф-харажат ҳалолдан бўлиши шарт.
        
        9. Исроф ва зиқналикдан четланган ҳолда, ўртача йўл тутиб, чин кўнгилдан зоди роҳила (йўл озиғи) ва таомини бемалол қилишга этибор қаратсин. Ҳаж йўлида еб-ичиш учун сарфланган ҳар бир сўмга етти юз баробар савоб берилади.
        
        10. Шаҳвоний нарсалар, фисқ-фужур ва жанжалга йўл қўймаслик. Аллоҳ таоло буни Қуръони Каримда таъкидлаган. Бу борадаги шаҳвоний нарсалар арабчада «рафас» дейилади ва барча шармсиз гап-сўз ҳамда хатти-ҳаракатларни ўз ичига олади. Аёлларга хушомад гапларни айтиш, шаҳвоний гап, ишора ва ҳаракатлар қилиш каби нарсалар рафасга киради. Фисқ эса, Аллоҳнинг ҳар бир тоатидан чиқишдир. Жанжал маълум ва машҳур нарса. Ҳаж қилувчи киши мазкур нарсалардан алоҳида эҳтиёт бўлиши лозим.
        
        11. Бақувват, юрса қийналмайдиган кишиларнинг пиёда ҳаж қилишлари афзал. Бемор, қари ва узрли кишиларнинг эса ибодатларига нуқсон етмаслиги учун улов миниб ҳаж қилганлари афзал.
        
        12. Ўзига вожиб бўлмаса ҳам, ҳожи жонлиқ сўйиб, қурбат ҳосил этишга ҳаракат қилсин. Қиладиган қурбонлиги семиз ва чиройли бўлишига эътибор берсин. Қурбонлик вожиб бўлса, ўзи емасин. Агар қурбонлик ихтиёрий бўлса, ўзи ҳам есин. `
    btn12.textContent = ''})

   btn3.addEventListener('click', () => {
    btn32.textContent = ` `
    btn22.innerHTML = `Ҳaммa тaйёpгapликлар ниҳoяcигa eтиб, ҳaж амалларини бошлаш навбати келади. Шyндa ҳаж aмaллapидaн биpинчиcи эҳром бўлaди.

    «Эҳром» apaбчa cўз бўлиб, лyғaтдa «ҳapoм қилмoқ» мaънocини aнглaтaди. Эҳромгa киpгaн oдaм учун эҳромдaн oлдин ҳaлoл бўлгaн бaъзи иш вa нapcaлap ҳapoм бўлaди. Mиcoл yчyн, бoшқa вaқтлapдa ўзигa xyшбўй нapcалapни ceпиши ҳaлoл эди, эҳромгa киpгaч, бy нapca ҳapoм бўлиб қoлaди.
    
    Эҳромнинг ҳақиқати ҳаж ёки умра ёки иккаласига бирданига ният қилиб, талбия айтишдир. Эҳром учун фақат ният қилиш ёки талбия айтиш кифоя қилмайди. Намозда қалб билан ният, тил билан эса такбири таҳрима айтилиши лозим ва шарт бўлгани каби ҳаж ёки умра эҳромига киришда ҳам ният билан талбия биргаликда топилиши лозимдир. Шу боис дилда ният қилиб, тил билан талбия ёки унинг ўрнини босадиган Аллоҳ таолонинг зикри айтилмаса, эҳромга кирган ҳисобланмайди. Шунингдек, тил билан талбия ёки унинг ўрнини босадиган Аллоҳ таолонинг зикрини айтиб, қалбда эҳромга киришни ният қилмаса, эҳромга кирган бўлмайди.
    
    Эркак кишининг умра ёки ҳаж ниятида тикилган кийим кийиши жоиз эмас. Агар тикилган кийим кийса, каффорат вожиб бўлади. Масалан, ёқаси йўқ кўйлак, иштон, қўлқоп, маҳси, майка, дўппи, костюм, камзул кабилар тикилган кийим саналади. Агар эркак киши юқоридаги кийимлардан бирортасини эҳром ҳолатида кийиб олса, жарима ва фидя лозим бўлади. Шунинг учун эҳром кийимлари тикилмаган бўлиши шартдир. Эҳромнинг суннати икки оқ мато олиб, бирини лунги каби, иккинчисини эса катта сочиқ каби елкасига ташлаб олишдир. Фақат тавоф вақтида юқорисига ташлаб олган катта сочиқ каби матони ўнг елкасини очиб қўлтиғининг остидан ўтказиб олади.
    
    Эҳром ҳолатидаги эркак кишиларнинг қоматига муносиб шаклда тикилган кийимни кийиб олиши жоиз эмас. Лекин шим ёки шалвар тарзида бўлмай, қоп каби тикилиб, икки томонини очиб олинса, зарари йўқ, яъни кароҳиятсиз жоиздир.  
    
    Эҳромгa киpмoқчи бўлгaн oдaм coчи, тиpнoғи, мўйлaбини вa oлиниши лoзим бўлгaн тyклapини oлиб, cўнгpa ғусл қилади. Кейин икки пapчa oқ, янги ёки ювилгaн мaтoни (халқ тилида «эҳром кийими»ни) олиб, биpини киндиги билан тиззacини қўшиб тўcaдигaн ҳолатда бeлигa тyтaди. Бy «изop» дeйилaди. Иккинчиcини eлкacи apалaш aйлaнтиpиб ўрайди. Бyниcи «pидo» дeйилaди. Бaдaнигa вa эҳром кийимигa xyшбўй нapca cypтaди, аммо y нapcaнинг paнги кийимдa қoлмacлиги шарт қилинади.
    
    Cўнгpa икки paкaт нaмoз ўқийди. Биpинчи paкaтдa Фoтиҳa cypacидaн кeйин Kaфиpyн, иккинчи paкaтдa Иxлoc cypacини ўқийди. Cўнгpa қaйcи ҳажни қилмoқчи бўлca, ўшaнгa мoc ният қилади. Macaлaн, ифpoд ҳажининг нияти:
    
    اللَّهُمَّ إِنِّي أُرِيدُ الْحَجَّ فَيَسِّرْهُ لِي وَتَقَبَّلْهُ مِنِّي
    
    
    
    «Aллoҳyммa инни ypидyл ҳaжжa фa яccирҳу ли вa тaқoббaлҳy минни.
    
    Яъни, «Аллоҳим, мeн ҳaжни иpoдa қилaмaн, yни мeнгa ocoн этгил вa қaбyл айлaгил».
    
    Taмaттyъ ҳажининг нияти:
    
    اللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ فَيَسِّرْهَا لِي وَتَقَبَّلْهَا مِنِّي
    
    
    
    «Aллoҳyммa инни ypидyл yмpатa фa яccиpҳa ли вa тaқoббaлҳa минни».
    
    Яъни, «Аллоҳим, мeн yмpaни иpoдa қилaмaн. Уни мeнгa ocoн этгил вa қaбyл айлагил».
    
    Қиpoн ҳажининг нияти:
    
    اللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ وَالْحَجَّ فَيَسِّرْهُمَا لِي وَتَقَبَّلْهُمَا مِنِّي
    
    
    
    «Aллoҳyммa иннии ypидyл yмpатa вaл-ҳaжжa фa яccиpҳyмa ли вa тaқoббaлҳyмa минни»
    
    Яъни, «Аллоҳим, мен yмpa вa ҳажни иpoдa қилaмaн, yлapни мeнгa ocoн этгил вa қабyл aйлaгил».
    
    Агар бирор киши номидан ҳажи бадал қилаётган бўлса, ўша киши номидан ният қилиб қуйидаги дуони ўқийди:
    
    اللَّهُمَّ إِنِّي أُرِيدُ الْحَجَّ عَنْ فُلَانٍ فَيَسِّرْهُ لِي وَتَقَبَّلْهُ مِنِّي عَنْهُ
    
    
    
    «Aллoҳyммa иннии ypидyл ҳaжжa ъан фулонин фa яccирҳу ли вa тaқoббaлҳy минни ъанҳу».
    
    Маъноси: «Аллоҳим, фалончининг номидан ҳaжни иpoдa қилдим, yни мeнгa ocoн этгин, мен ва унинг тарафидан қaбyл этгин.`
   })
    btn1.appendChild(btn12)
    btn2.appendChild(btn22)
    btn3.appendChild(btn32)

    
        
    hajIbodati.appendChild(btn1)
    hajIbodati.appendChild(btn2)
    hajIbodati.appendChild(btn3)
    
})

const ushr = document.querySelector('#zakot')   

zakot.addEventListener('click', () => {

    hajIbodati.textContent = ''
    

   

    const btn1 = document.createElement('div')
    const btn2 = document.createElement('div')
    const btn3 = document.createElement('div')

    btn1.textContent = `Zakot nima.`
    btn2.textContent = `Zakotning fiqhiy hukmlari.`
    btn3.textContent = `Zakot olish mumkin bo'lmaganlar.`

    btn1.classList.add('index')
    btn2.classList.add('index')
    btn3.classList.add('index')

    const btn12 = document.createElement('div')    
    const btn22 = document.createElement('div') 
    const btn32 = document.createElement('div') 

    btn12.classList.add('child')
    btn22.classList.add('child')
    btn32.classList.add('child')

    btn1.addEventListener('click',() => {
        btn12.textContent = `«Закот» сўзи луғатда «поклик» ва «ўсиш» деган маъноларни англатади. Закот берган кишининг моли покланади. Қачон закотини берса, покланади, бўлмаса йўқ. Закоти берилган молга барака киради, кўпайиб, ўсади.

        Шаръий истилоҳда «Закот – махсус молдан махсус жузни махсус шахсга Аллоҳнинг розилиги учун шариатда тайин қилингандек мулк қилиб беришдир».
        
        «Махсус мол» – нисобга етган мол демакдир. «Махсус жуз» – закот берувчининг мулкидан ажратиладиган миқдордир. Мисол учун, бир кишига «Ушбу уйда бир йил ўтириб туришинг сенга закот», деб бўлмайди. «Махсус шахс» деганда закот олишга ҳақли бўлган шахс назарда тутилган. «Аллоҳнинг розилиги учун» жумласи эса закотнинг ибодат нияти билан берилиши кераклигини англатади. «Шариат тайин қилган» деганда закот чиқариш миқдори шариатда кўрсатилган миқдорга тўғри келиши кераклиги назарда тутилади. Озгина садақа бериб, «шу закот» деб бўлмайди. «Мулк қилиб бериш» деган жумладан эса «ўша берилаётган мол уни олувчига мулк бўлмагунича закот бўлмайди» деган маъно англанади.
        
        Закот Исломнинг беш рукнидан бири бўлиб, шариат фарз қилган амалдир.
        
        Закот Исломдаги беш рукннинг учинчисидир. У исломий ибодат бўлиб, ақийданинг ажралмас қисмидир. Ким закотни инкор этса, кофир бўлади, бордию уни адо этмаса, осий бўлади. 
        
        Фиқҳ китобларимизда ибодатлар қисми алоҳида, муомалалар қисми алоҳида баён қилинган бўлиб, закот ибодатлар қисмида келган. Закотда ибодат маъноси бўлиши билан бирга, улуғ инсоний ғоялар, ахлоқий кўринишлар, руҳий қадриятлар ҳам мавжуд. Унда фақат моддий маъно эмас, балки маънавий, руҳий, ахлоқий маънолар ҳам ўз аксини топган. Закотда уни берувчига ҳам, закот олувчига ҳам, улар яшаб турган жамиятга ҳам кўплаб дунёвий ва ухровий фойдалар бор.
        
        Закот ибодати туфайли закот берувчи киши ўзининг ихтиёридаги мол-дунё Аллоҳ томонидан берилган неъмат эканини, бу мол-дунёга вақтинчалик эга бўлиб турганини тушуниб етади. Шунинг учун у қўлидаги мол-дунёни Аллоҳ кўрсатган ҳалол-пок йўлларга сарфлашга интилади. Бу ҳар бир шахс, ҳар бир жамият учун иқтисодий муаммоларни ҳал қилишда жуда муҳим ва зарур омилдир. 
        
        Закот ибодати нафақат закот берувчи ва закот олувчига, балки жамиятга ҳам улкан фойда келтиради. Шунинг учун закот ибодати татбиқ қилинган жамиятларда кўп мушкулот ва муаммолар ўз-ўзидан ҳал бўлади.`
    btn32.innerHTML = ''
})

    btn2.addEventListener('click',()=> {
        btn22.textContent = `I. Закотберувчида бўлиши лозим шартлар:

        1. Мусулмон бўлиш.
        
        2. Балоғатга етган бўлиш.
        
        3. Оқил бўлиш. 
        
        4. Ҳур бўлиш.
        
        II. Закотфарз бўлиши учун молда бўлиши лозим шартлар:
        
        1. Нисобгаетиши.
        
        2. Тўлиқмулк бўлиши.
        
        3. Феъланёки тақдиран ўсувчи мол бўлиши.
        
        4. Ҳожатиаслиядан ортиқча бўлиши.
        
        5. Қарзданхоли бўлиши.
        
        6. Бир йил тўлган бўлиши керак.
        
        III. Закотнинг тўғри бўлиши шартлари:
        
        1. Ният.
        
        2. Ҳақдорга мулк қилиб берилиши.
        
        1. Ният. 
        
        Закотни адо этиш вақтида ёки уни ажратиш вақтида ният қилиш шартдир. Молнинг ҳаммасини садақа қилиб юборса, ният қилиш шарт эмас.
        
        Закотнинг тўғри бўлиб, ўрнига ўтиши учун энг муҳим шарт закот беришни ният қилишдир. Чунки Исломда ҳеч бир ибодат ниятсиз бўлмайди. 
        
        2. Ҳақдорга мулк қилиб берилиши. 
        
        Закот тўғри бўлиши учун ажратилган мол закот берувчи томонидан ҳақдорларга мулк қилиб берилиши керак. Фойдаланиб туришга берилган буюмлар закот бўлмайди, шунингдек, кишиларни таомлантириб, «мана шу менинг закотим» дейиш ҳам жоиз эмас. Лекин таом сотиб олиб, закот деб ният қилиб берса бўлади.
        
        Ҳанафий мазҳаби бўйича, ақли заиф ёки ёш болага закот бериб бўлмайди. 
        
        «Садақа қилинди» дегани «бировга бир нарса мулк қилиб берилди» деганидир. «Фақирларгадир» деганда ҳам араб тили қоидасида уларга мулк қилиб бериш тушунилади.`
    btn12.textContent = ''})

   btn3.addEventListener('click', () => {
    btn32.textContent = ` `
    btn22.innerHTML = `Закот олиши ҳаром бўлганлар қуйидагилардир:

    Орасида туғишганлик ва эр-хотинлик алоқаси борлар.
    
    Бу тоифага кишининг туққанлари, яъни ота-онаси, бобо-момолари неча поғона юқори бўлса ҳам киради. Мазкур киши ана ўшаларга закотини бериши мумкин эмас.
    
    Ўзининг қулига, бир қисмини озод қилган қулига закот берилмайди.
    
    Қул хожанинг мулки бўлади. Ўзининг мулкига закот бериш дуруст эмас.
    
    Зиммийга эмас. Унга (зиммийга) закотдан бошқасини берса бўлади.
    
    Зиммийга закотдан бошқасини берса бўлади. Ислом давлати соясида яшаётган «аҳли зимма» деб аталувчи бошқа дин вакилларига закотдан бериб бўлмайди. Чунки закот мусулмонлардан олиниб, мусулмонларга берилиши шарт. Аммо аҳли зиммага нафл садақалардан, садақаи фитрдан берса бўлади. Чунки аввал айтилганидек, закот молиявий ибодат бўлиб, уни бериш учун ҳам, олиш учун ҳам мусулмон бўлиш керак.
    
    Фосиқ кишига закот берса бўладими?
    
    «Фосиқ» деб баъзи гуноҳ ишларни қилиб номи чиққан одамга айтилади. Ўзи мусулмон одам-у, лекин гуноҳ ишлар ҳам қилган бўлади. Қадимги уламоларимиз бундай одамларга закот бериш мумкин, дейишган ва закотни олгандан кейин уни фисқ ва гуноҳ ишларга сарфламаслиги аниқ бўлиши керак, деган шартни қўйишган.
    
    Куч-қуввати етарли, бирор касбга қодир кишиларга закотдан берилмайди.
    
    Касб-корга қодир бўлган, соғлом кишига закотдан улуш берилмаслиги учун унда қуйидаги шартлар мавжуд бўлиши керак:
    
    1) Ўз касбига яраша иши мавжуд бўлиши;
    
    2) Бу иш ҳалол иш бўлиши;
    
    3) Мазкур иш тоқатидан ташқари, чидаб бўлмайдиган даражада бўлмаслиги;
    
    4) Бу иш унга муносиб, ўзига ўхшаш кишиларнинг обрўсини тўкмайдиган иш бўлиши;
    
    5) Ўзида ва қарамоғидагиларда етарли касб қилиш имкони бўлиши.
    
    Таркидунё қилиб, ибодатга берилган одамга закотдан улуш берилмайди.`
   })
    btn1.appendChild(btn12)
    btn2.appendChild(btn22)
    btn3.appendChild(btn32)

    
        
    ushr.appendChild(btn1)
    ushr.appendChild(btn2)
    ushr.appendChild(btn3)
    
})




const namoz_vaqtlari = document.querySelector('.namoz_vaqtlari')

const namoz_vaqti = document.querySelector('#namoz_vaqtlari')





namoz_vaqtlari.addEventListener('click', () => {

    iyman.textContent = ''
    namaz.textContent = ''
    rozador.textContent = ''
    hajIbodati.textContent = ''
    ushr.textContent = ''

    const button1 = document.createElement('div')
    const button2 = document.createElement('div')
    const button3 = document.createElement('div')
    const button4 = document.createElement('div')
    const button5 = document.createElement('div')

    button1.textContent = 'Bomdod namozi'
    button2.textContent = 'Peshin namozi'
    button3.textContent = 'Asr namozi'
    button4.textContent = 'Shom namozi'
    button5.textContent = 'Xufton namozi'

    namoz_vaqti.appendChild(button1)
    namoz_vaqti.appendChild(button2)
    namoz_vaqti.appendChild(button3)
    namoz_vaqti.appendChild(button4)
    namoz_vaqti.appendChild(button5)

    button1.addEventListener('click', () => {
        quyosh.textContent = `Субҳи содиқдан (чин тонг отгандан) кун чиққунчадир.
        Бомдод намозини тонг ёришганда ўқиш мустаҳаб, аълороқдир. Соат бўйича ҳисобланса, бомдодни кун чиқишидан 40 дақиқача илгари ўқиш мустаҳаб вақтига мувофиқ бўлади.`
        
    })

    button2.addEventListener('click', () => {
        quyosh1.textContent = `Қуёш заволга (оғишга) кетганидан сўнг то нарсаларнинг сояси қуёш тиккага келган пайтдаги со-ясидан ташқари ўз узунлигига нисбатан икки баравар ортгунига қадар.
        Пешин намозини ёз фаслида бироз кечиктириб, қиш фаслида эса вақти кириши билан ўқиш мустаҳабдир.`
        quyosh.textContent = ''
    })

    button3.addEventListener('click', () => {
        quyosh2.textContent = `Ҳар бир нарсанинг сояси қуёш тиккага келган пайтдаги соясидан ташқари ўзига нисбатан икки баравар ортганидан бошлаб қуёш ботгунчадир.
        Аср намозини қуёш тиғини ўзгартирмай, нурсиз ҳолатга кири-шидан олдинроқ ўқиш мустаҳабдир.`
        quyosh1.textContent = ''
    })

    button4.addEventListener('click', () => {
        quyosh3.textContent = `Кун ботган пайтдан бошлаб кунботар томонда шафақ (қизғиш нурлар) ғойиб бўлгунчадир.
        Шом намозини доимо қуёш ботиши билан ўқиш мустаҳабдир.`
        quyosh2.textContent = ''
    })

    button5.addEventListener('click', () => {
        quyosh4.textContent = `Шафақ батамом йўқолгандан кейин киради.
        Хуфтон намозини кечанинг учдан бирининг охирида ўқиш афзал ва ниҳоятда аъло бўлади.`
        quyosh3.textContent = ''
    })

    


})

a.addEventListener('click', () => {
    
    iyman.textContent = ''
    namaz.textContent = ''
    rozador.textContent = ''
    hajIbodati.textContent = ''
    ushr.textContent = ''

    quyosh.textContent = ''
    quyosh1.textContent = ''
    quyosh2.textContent = ''
    quyosh3.textContent = ''
    quyosh4.textContent = ''
})


function showTime() {
    var date = new Date();
    var h = date.getHours();
    var m = date.getMinutes();
    var s = date.getSeconds();
    var session = "";

    // if (h == 0) {
    //     h = 12; // 12 Hour Format
    // }

    if (h > 12) {
        h = h - 12; // 12 Hour Format
        session = "";
    }


    // if (h < 10) {
    //     h = "0" + h;
    // }

    // if (m < 10) {
    //     m = "0" + m;
    // }

    // if (s < 10) {
    //     s = "0" + s;
    // }

    h = (h < 10) ? "0" + h : h;
    m = (m < 10) ? "0" + m : m;
    s = (s < 10) ? "0" + s : s;


    document.getElementById("digital-clock").innerHTML = h + ":" + m + ":" + s + " " + session;
    setTimeout(showTime, 1000);
}
showTime();
